In [1]:
import pandas as pd
import numpy as np

In [2]:
movie = pd.read_csv("movie_metadata.csv")

## Prepare the Movie_Genre and Genre table

In [3]:
mg = pd.read_csv("movie_genre_row.csv")

In [4]:
mg.head()

                                        title                            genre
0                                      Avatar  Action|Adventure|Fantasy|Sci-Fi
1    Pirates of the Caribbean: At World's End         Action|Adventure|Fantasy
2                                     Spectre        Action|Adventure|Thriller
3                       The Dark Knight Rises                  Action|Thriller
4  Star Wars: Episode VII - The Force Awakens                      Documentary

In [5]:
movie_genre = (mg.set_index(['title'])
   .apply(lambda x: x.str.split('|').explode())
   .reset_index())
movie_genre.head(10)

                                      title      genre
0                                    Avatar     Action
1                                    Avatar  Adventure
2                                    Avatar    Fantasy
3                                    Avatar     Sci-Fi
4  Pirates of the Caribbean: At World's End     Action
5  Pirates of the Caribbean: At World's End  Adventure
6  Pirates of the Caribbean: At World's End    Fantasy
7                                   Spectre     Action
8                                   Spectre  Adventure
9                                   Spectre   Thriller

In [6]:
## create genre table from the above dataframe
genre = pd.DataFrame(movie_genre.genre)
genre.drop_duplicates(inplace = True)

In [10]:
genre = genre.reset_index().drop("index",1)
genre.head(), genre.shape

(       genre
 0     Action
 1  Adventure
 2    Fantasy
 3     Sci-Fi
 4   Thriller,
 (26, 1))

In [13]:
movie_genre.to_csv("movie_genre.csv")
genre.to_csv("genre.csv")

## Prepare the Director table

In [17]:
director = pd.read_csv("director_row.csv")
director.shape

(5042, 2)

In [18]:
director.drop_duplicates(inplace = True)
director.dropna(inplace = True)
director.shape

(2402, 2)

In [19]:
director.head()

       director_name  director_fb_likes
0      James Cameron                0.0
1     Gore Verbinski              563.0
2         Sam Mendes                0.0
3  Christopher Nolan            22000.0
4        Doug Walker              131.0

In [26]:
director.rename(columns ={"director_name":"director", "director_fb_likes":"fb_like"}, inplace = True)
director.head()

            director  fb_like
0      James Cameron      0.0
1     Gore Verbinski    563.0
2         Sam Mendes      0.0
3  Christopher Nolan  22000.0
4        Doug Walker    131.0

In [33]:
director.to_csv("director.csv")

## Prepare the Actor table

In [27]:
actor = pd.read_csv("actor_row.csv")
actor.head()

              name  fb_like
0      CCH Pounder   1000.0
1      Johnny Depp  40000.0
2  Christoph Waltz  11000.0
3        Tom Hardy  27000.0
4      Doug Walker    131.0

In [31]:
actor.drop_duplicates(inplace = True)
actor.dropna(inplace = True)
actor.rename(columns = {"name" : "actor"}, inplace = True)
actor.reset_index().drop("index", axis = 1)
actor.head()

             actor  fb_like
0      CCH Pounder   1000.0
1      Johnny Depp  40000.0
2  Christoph Waltz  11000.0
3        Tom Hardy  27000.0
4      Doug Walker    131.0

In [32]:
actor.to_csv("actor.csv")

## Prepare the Movie_Actor table

In [7]:
ma = pd.read_csv("movie_actor_row.csv")

In [8]:
ma.head()

,title,actor_1_name,actor_2_name,actor_3_name
0,Avatar,CCH Pounder,Joel David Moore,Wes Studi
1,Pirates of the Caribbean: At World's End,Johnny Depp,Orlando Bloom,Jack Davenport
2,Spectre,Christoph Waltz,Rory Kinnear,Stephanie Sigman
3,The Dark Knight Rises,Tom Hardy,Christian Bale,Joseph Gordon-Levitt
4,Star Wars: Episode VII - The Force Awakens,Doug Walker,Rob Walker,NaN

In [9]:
## stack the table, so that we only have two columns indicating the movie-actor relationship
movie_actor = ma.set_index("title").stack().reset_index().drop("level_1",1).rename(columns = {0:"name"})
movie_actor.head(10)

                                      title              name
0                                    Avatar       CCH Pounder
1                                    Avatar  Joel David Moore
2                                    Avatar         Wes Studi
3  Pirates of the Caribbean: At World's End       Johnny Depp
4  Pirates of the Caribbean: At World's End     Orlando Bloom
5  Pirates of the Caribbean: At World's End    Jack Davenport
6                                   Spectre   Christoph Waltz
7                                   Spectre      Rory Kinnear
8                                   Spectre  Stephanie Sigman
9                     The Dark Knight Rises         Tom Hardy

In [10]:
movie_actor.to_csv("movie_actor.csv")